GopalSaraf/Practicals/PSDL/include/proc/pic16lf1527.inc
// Register: TMR10
#define TMR10 TMR10
TMR10                                    equ 059Ch
// bitfield definitions
TMR10_TMR10_POSN                         equ 0000h
TMR10_TMR10_POSITION                     equ 0000h
TMR10_TMR10_SIZE                         equ 0008h
TMR10_TMR10_LENGTH                       equ 0008h
TMR10_TMR10_MASK                         equ 00FFh

// Register: PR10
#define PR10 PR10
PR10                                     equ 059Dh
// bitfield definitions
PR10_PR10_POSN                           equ 0000h
PR10_PR10_POSITION                       equ 0000h
PR10_PR10_SIZE                           equ 0008h
PR10_PR10_LENGTH                         equ 0008h
PR10_PR10_MASK                           equ 00FFh

// Register: T10CON
#define T10CON T10CON
T10CON                                   equ 059Eh
// bitfield definitions
T10CON_T10CKPS_POSN                      equ 0000h
T10CON_T10CKPS_POSITION                  equ 0000h
T10CON_T10CKPS_SIZE                      equ 0002h
T10CON_T10CKPS_LENGTH                    equ 0002h
T10CON_T10CKPS_MASK                      equ 0003h
T10CON_TMR10ON_POSN                      equ 0002h
T10CON_TMR10ON_POSITION                  equ 0002h
T10CON_TMR10ON_SIZE                      equ 0001h
T10CON_TMR10ON_LENGTH                    equ 0001h
T10CON_TMR10ON_MASK                      equ 0004h
T10CON_T10OUTPS_POSN                     equ 0003h
T10CON_T10OUTPS_POSITION                 equ 0003h
T10CON_T10OUTPS_SIZE                     equ 0004h
T10CON_T10OUTPS_LENGTH                   equ 0004h
T10CON_T10OUTPS_MASK                     equ 0078h
T10CON_T10CKPS0_POSN                     equ 0000h
T10CON_T10CKPS0_POSITION                 equ 0000h
T10CON_T10CKPS0_SIZE                     equ 0001h
T10CON_T10CKPS0_LENGTH                   equ 0001h
T10CON_T10CKPS0_MASK                     equ 0001h
T10CON_T10CKPS1_POSN                     equ 0001h
T10CON_T10CKPS1_POSITION                 equ 0001h
T10CON_T10CKPS1_SIZE                     equ 0001h
T10CON_T10CKPS1_LENGTH                   equ 0001h
T10CON_T10CKPS1_MASK                     equ 0002h
T10CON_T10OUTPS0_POSN                    equ 0003h
T10CON_T10OUTPS0_POSITION                equ 0003h
T10CON_T10OUTPS0_SIZE                    equ 0001h
T10CON_T10OUTPS0_LENGTH                  equ 0001h
T10CON_T10OUTPS0_MASK                    equ 0008h
T10CON_T10OUTPS1_POSN                    equ 0004h
T10CON_T10OUTPS1_POSITION                equ 0004h
T10CON_T10OUTPS1_SIZE                    equ 0001h
T10CON_T10OUTPS1_LENGTH                  equ 0001h
T10CON_T10OUTPS1_MASK                    equ 0010h
T10CON_T10OUTPS2_POSN                    equ 0005h
T10CON_T10OUTPS2_POSITION                equ 0005h
T10CON_T10OUTPS2_SIZE                    equ 0001h
T10CON_T10OUTPS2_LENGTH                  equ 0001h
T10CON_T10OUTPS2_MASK                    equ 0020h
T10CON_T10OUTPS3_POSN                    equ 0006h
T10CON_T10OUTPS3_POSITION                equ 0006h
T10CON_T10OUTPS3_SIZE                    equ 0001h
T10CON_T10OUTPS3_LENGTH                  equ 0001h
T10CON_T10OUTPS3_MASK                    equ 0040h

// Register: CCPR6L
#define CCPR6L CCPR6L
CCPR6L                                   equ 0611h
// bitfield definitions
CCPR6L_CCPR6L_POSN                       equ 0000h
CCPR6L_CCPR6L_POSITION                   equ 0000h
CCPR6L_CCPR6L_SIZE                       equ 0008h
CCPR6L_CCPR6L_LENGTH                     equ 0008h
CCPR6L_CCPR6L_MASK                       equ 00FFh

// Register: CCPR6H
#define CCPR6H CCPR6H
CCPR6H                                   equ 0612h
// bitfield definitions
CCPR6H_CCPR6H_POSN                       equ 0000h
CCPR6H_CCPR6H_POSITION                   equ 0000h
CCPR6H_CCPR6H_SIZE                       equ 0008h
CCPR6H_CCPR6H_LENGTH                     equ 0008h
CCPR6H_CCPR6H_MASK                       equ 00FFh

// Register: CCP6CON
#define CCP6CON CCP6CON
CCP6CON                                  equ 0613h
// bitfield definitions
CCP6CON_CCP6M_POSN                       equ 0000h
CCP6CON_CCP6M_POSITION                   equ 0000h
CCP6CON_CCP6M_SIZE                       equ 0004h
CCP6CON_CCP6M_LENGTH                     equ 0004h
CCP6CON_CCP6M_MASK                       equ 000Fh
CCP6CON_DC6B_POSN                        equ 0004h
CCP6CON_DC6B_POSITION                    equ 0004h
CCP6CON_DC6B_SIZE                        equ 0002h
CCP6CON_DC6B_LENGTH                      equ 0002h
CCP6CON_DC6B_MASK                        equ 0030h
CCP6CON_CCP6M0_POSN                      equ 0000h
CCP6CON_CCP6M0_POSITION                  equ 0000h
CCP6CON_CCP6M0_SIZE                      equ 0001h
CCP6CON_CCP6M0_LENGTH                    equ 0001h
CCP6CON_CCP6M0_MASK                      equ 0001h
CCP6CON_CCP6M1_POSN                      equ 0001h
CCP6CON_CCP6M1_POSITION                  equ 0001h
CCP6CON_CCP6M1_SIZE                      equ 0001h
CCP6CON_CCP6M1_LENGTH                    equ 0001h
CCP6CON_CCP6M1_MASK                      equ 0002h
CCP6CON_CCP6M2_POSN                      equ 0002h
CCP6CON_CCP6M2_POSITION                  equ 0002h
CCP6CON_CCP6M2_SIZE                      equ 0001h
CCP6CON_CCP6M2_LENGTH                    equ 0001h
CCP6CON_CCP6M2_MASK                      equ 0004h
CCP6CON_CCP6M3_POSN                      equ 0003h
CCP6CON_CCP6M3_POSITION                  equ 0003h
CCP6CON_CCP6M3_SIZE                      equ 0001h
CCP6CON_CCP6M3_LENGTH                    equ 0001h
CCP6CON_CCP6M3_MASK                      equ 0008h
CCP6CON_DC6B0_POSN                       equ 0004h
CCP6CON_DC6B0_POSITION                   equ 0004h
CCP6CON_DC6B0_SIZE                       equ 0001h
CCP6CON_DC6B0_LENGTH                     equ 0001h
CCP6CON_DC6B0_MASK                       equ 0010h
CCP6CON_DC6B1_POSN                       equ 0005h
CCP6CON_DC6B1_POSITION                   equ 0005h
CCP6CON_DC6B1_SIZE                       equ 0001h
CCP6CON_DC6B1_LENGTH                     equ 0001h
CCP6CON_DC6B1_MASK                       equ 0020h

